openfoam/pipeQuarter-rans/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -1);

boundaryField
{
    rotor
    {
        type            fixedValue;
        value           uniform (0 0 1);
//        type            cyclic;

//	type slip;

//type rotatingWallVelocity;
//origin (0 0 0);
//axis (0 0 1);
//omega 1;
    }
    stator
    {
 //       type            fixedValue;
        type            inletOutlet;
 inletValue      uniform (0 0 1);
//        type            cyclic;
    //    value           uniform (0 0 0);
//	type slip;
    }
    shroud
    {
        //type            fixedValue;
       //value           uniform (0 0 0);
	//type slip;
	type noSlip;
//type rotatingWallVelocity;
//origin (0 0 0);
//axis (0 0 1);
//omega 1;

    }
    hub
    {
//        type            fixedValue;
  //      value           uniform (0 0 0);
//	type noSlip;
	type slip;
    }


    inlet
    {
        type            slip;
//        type           cyclic;
//        type            fixedValue;
  //     value           uniform (0 0 0);
//	type noSlip;


    }

    outlet
    {
//        type            slip;

//        type            cyclic;
//        type            fixedValue;
//       value           uniform (0 0 0);
	type noSlip;


    }


}

// ************************************************************************* //
